[
    {
        "id": "1",
        "chef_name": "Chef Martin Yan",
        "experience": "6",
        "recipes_numbers": "15",
        "likes": "4.5",
        "description": "Chef Martin Yan is a well-known Chinese chef, author, and television personality. He was born in Guangzhou, China, in 1948 and grew up in Hong Kong. Yan is best known for his PBS television show, Yan Can Cook, which premiered in 1982 and showcased his culinary skills and infectious personality. He has authored over 30 cookbooks, including Martin Yan's Feast and Martin Yan's China, and has won numerous awards for his contributions to the culinary world. Yan continues to promote Chinese cuisine and culture through his cooking and television appearances.",
        "chef_img": "https://kitchenchat.info/wp-content/uploads/2021/01/IMG_1404-788x1024.jpg",
        "recipe_img1": "https://www.kitchensanctuary.com/wp-content/uploads/2019/10/Kung-Pao-Chicken-square-FS-39-new.jpg",
        "recipe_name1": "Kung Pao Chicken",
        "recipe_ingredients1": [
            "1 pound boneless",
            "skinless chicken breast",
            "cut into bite-sized pieces",
            "1 tablespoon cornstarch",
            "2 tablespoons soy sauce",
            "2 tablespoons rice wine or dry sherry",
            "1 tablespoon brown sugar",
            "2 tablespoons vegetable oil",
            "1/2 cup peanuts",
            "6-8 dried red chili peppers",
            "2 cloves garlic, minced",
            "1-inch piece of ginger, peeled and minced",
            "1 green onion, sliced"
        ],
        "recipe_cooking_method1": "In a medium bowl, combine the cornstarch, soy sauce, rice wine or sherry, and brown sugar. Mix well. Add the chicken to the bowl and stir until well coated. Set aside for 10-15 minutes to marinate. Heat a wok or large skillet over high heat. Add the vegetable oil and swirl to coat the pan. Add the peanuts to the pan and stir-fry for 1-2 minutes until lightly toasted. Remove the peanuts from the pan and set aside. Add the dried chili peppers to the pan and stir-fry for 1-2 minutes until fragrant. Remove the chili peppers from the pan and set aside. Add the chicken to the pan and stir-fry for 3-4 minutes until browned and cooked through. Add the garlic and ginger to the pan and stir-fry for 1-2 minutes until fragrant. Return the peanuts and chili peppers to the pan, along with the sliced green onion. Stir-fry for an additional 1-2 minutes until the ingredients are well combined and heated through. Serve hot with steamed rice. ",
        "rating1": 5,
        "recipe_img2": "https://lh3.ggpht.com/M0_ImWB44LdALfkSVWWJL0iJfjzTAU_gx8QVQjAqHUl8LU5WMe0CnwWB8__QrL4Go3R2MYmmQO77MSRoBWtU=w640-h640-c-rw-v1-e365",
        "recipe_name2": "Cantonese Lobster",
        "recipe_ingredients2": [
            "2 live lobsters (about 1.5-2 pounds each)",
            "3 tablespoons vegetable oil",
            "6 slices ginger",
            "6 green onions, cut into 2-inch pieces",
            "1 tablespoon Shaoxing wine (Chinese rice wine)",
            "2 tablespoons soy sauce",
            "1 teaspoon sugar",
            "1/2 cup chicken broth",
            "1 teaspoon cornstarch",
            "Salt and pepper to taste"
        ],
        "recipe_cooking_method2": "Prepare the lobster by first washing them thoroughly under cold water. Then, twist off the claws and remove the tail meat from the shells. Cut the tail meat into bite-sized pieces and set aside. Crack the claws with a nutcracker or mallet and set aside as well. Heat the oil in a wok or large skillet over high heat. Add the ginger and green onions and stir-fry for 1-2 minutes until fragrant. Add the lobster meat to the wok and stir-fry for 1-2 minutes until the meat turns pink. Add the Shaoxing wine, soy sauce, sugar, and chicken broth to the wok and bring to a boil. In a small bowl, mix the cornstarch with 1 tablespoon of water and stir until smooth. Add this mixture to the wok and stir until the sauce thickens. Season with salt and pepper to taste. Serve the lobster hot with the sauce poured over the top. Enjoy your delicious Ginger and Scallion Lobster! ",
        "rating2": 3,
        "recipe_img3": "https://lh3.googleusercontent.com/MmEXHHqM-_MUXNCTPtl_cI3IafZDQvfcKC4ZpS6NJB5DBkbjKW6Kij66me6tVscSM0R8x0E8i7RWNkut2Tcv2zQ=w640-h640-c-rw-v1-e365",
        "recipe_name3": "Chinese Doughnuts",
        "recipe_ingredients3": [
            "2 cups all-purpose flour",
            "2 teaspoons baking powder",
            "1/2 teaspoon salt",
            "3/4 cup warm water",
            "1/4 cup vegetable oil",
            "Oil for deep-frying"
        ],
        "recipe_cooking_method3": "In a large mixing bowl, whisk together the flour, baking powder, and salt. Slowly add the warm water to the dry ingredients, stirring until a dough forms. Knead the dough for 5-7 minutes until it becomes smooth and elastic. Divide the dough into two equal pieces and roll each piece out into a long, thin rectangle (about 10 inches long and 3 inches wide). Brush the top of each rectangle with vegetable oil. Fold one of the long sides of the dough over to the middle, then fold the other long side over to meet it, creating a long, thin strip of dough. Cut the strip of dough into 1-inch pieces. Heat the oil for deep-frying in a large pot or wok until it reaches 375°F. Gently add the dough pieces to the hot oil, a few at a time, and fry for 3-4 minutes until they are golden brown and crispy. Remove the doughnuts from the oil with a slotted spoon and drain them on a paper towel-lined plate. Serve the Chinese doughnuts warm with soy milk or congee, or on their own as a tasty snack. Enjoy your homemade Chinese doughnuts! ",
        "rating3": 4,
        "quantity": 0
    },
    {
        "id": "2",
        "chef_name": "Chef Ken Hom",
        "experience": "5.5",
        "recipes_numbers": "20",
        "likes": "4",
        "description": "Chef Ken Hom is a Chinese chef, author, and television presenter. He is known for his expertise in Chinese cuisine and has authored over 30 cookbooks. Hom has also hosted several cooking shows, including Ken Hom's Chinese Cookery and Exploring China: A Culinary Adventure. He has received numerous awards for his contributions to the culinary world.",
        "chef_img": "https://i.pinimg.com/736x/80/f9/1e/80f91e13c595c3fa59a4b0b6d2380ffc--ken-hom-chinese-american.jpg",
        "recipe_img1": "https://allasiarecipes.com/wp-content/uploads/2020/07/Peking-duck.jpg",
        "recipe_name1": "Peking duck",
        "recipe_ingredients1": [
            "1 whole duck (around 4-5 pounds)",
            "2 tablespoons honey",
            "2 tablespoons soy sauce",
            "1 tablespoon rice vinegar",
            "1 teaspoon five-spice powder",
            "1 tablespoon Shaoxing wine (Chinese rice wine)",
            "Salt. Scallions, thinly sliced",
            "Cucumbers, thinly sliced",
            "Hoisin sauce Pancakes (can be found in Asian grocery stores)"
        ],
        "recipe_cooking_method1": "Day 1: Remove any innards from the duck and pat it dry with paper towels. In a small bowl, mix together the honey, soy sauce, rice vinegar, five-spice powder, and Shaoxing wine to make a marinade. Rub the marinade all over the duck, inside and out, making sure to coat it evenly. Place the duck on a wire rack set over a baking sheet and refrigerate, uncovered, overnight. Day 2: Preheat the oven to 375°F. Sprinkle salt over the duck skin and let it sit at room temperature for 30 minutes. Roast the duck in the oven for 1 hour and 30 minutes, turning it over halfway through cooking. Increase the oven temperature to 425°F and roast the duck for an additional 10-15 minutes until the skin is crispy and golden brown. Remove the duck from the oven and let it rest for 10 minutes before carving it into thin slices. Serve the Peking Duck with scallions, cucumbers, hoisin sauce, and pancakes. To assemble the pancake: Take a pancake and brush hoisin sauce over it. Add a few slices of duck meat, scallions, and cucumbers. Fold the pancake over and enjoy! ",
        "rating1": 3,
        "recipe_img2": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/fried-stuffed-cucumbers-8b27fc9.jpg?resize=768,574",
        "recipe_name2": "Fried stuffed cucumbers",
        "recipe_ingredients2": [
            "3-4 large cucumbers",
            "1/2 pound ground pork",
            "1/4 cup chopped scallions",
            "2 tablespoons soy sauce",
            "1 tablespoon Shaoxing wine (Chinese rice wine)",
            "1 tablespoon cornstarch",
            "1 tablespoon sesame oil",
            "1 teaspoon sugar",
            "1/4 teaspoon black pepper",
            "Oil for frying"
        ],
        "recipe_cooking_method2": "Cut the cucumbers into 2-inch long pieces and use a small spoon or melon baller to scoop out the seeds from the center, leaving a cavity in each piece. In a large mixing bowl, combine the ground pork, scallions, soy sauce, Shaoxing wine, cornstarch, sesame oil, sugar, and black pepper. Mix well. Stuff each cucumber piece with the pork mixture, using a spoon to press it in tightly. Heat about 1 inch of oil in a large skillet or wok over medium-high heat until it reaches 350°F. Carefully add the stuffed cucumber pieces to the hot oil, a few at a time, and fry for 2-3 minutes until they are golden brown and crispy. Remove the stuffed cucumbers from the oil with a slotted spoon and drain them on a paper towel-lined plate. Serve the fried stuffed cucumbers hot as an appetizer or snack. Enjoy your homemade fried stuffed cucumbers! ",
        "rating2": 4,
        "recipe_img3": "https://realfood.tesco.com/media/images/Chinese-chicken--sweetcorn-soup-recipe-472x310-db05a4dc-9d13-418f-a0a5-4e3bc1012083-0-472x310.jpg",
        "recipe_name3": "Curried sweetcorn soup with chicken",
        "recipe_ingredients3": [
            "2 tablespoons vegetable oil",
            "1 onion, chopped",
            "2 garlic cloves, minced",
            "1 tablespoon grated ginger",
            "2 teaspoons curry powder",
            "1/2 teaspoon ground cumin",
            "1/4 teaspoon ground coriander",
            "4 cups chicken stock",
            "1 (14-ounce) can creamed corn",
            "2 cups fresh or frozen sweetcorn kernels",
            "2 cups cooked and shredded chicken",
            "Salt and black pepper to taste",
            "1/4 cup chopped fresh cilantro"
        ],
        "recipe_cooking_method3": "Heat the vegetable oil in a large pot over medium heat. Add the chopped onion and cook for 5-7 minutes until it is soft and translucent. Add the minced garlic, grated ginger, curry powder, ground cumin, and ground coriander to the pot. Stir well and cook for 1-2 minutes until fragrant. Pour in the chicken stock and stir to combine. Bring the mixture to a simmer. Add the creamed corn, sweetcorn kernels, and shredded chicken to the pot. Stir to combine. Season the soup with salt and black pepper to taste. Simmer the soup for 10-15 minutes until the sweetcorn kernels are tender and the soup has thickened slightly.Remove the soup from the heat and stir in the chopped cilantro. Ladle the soup into bowls and serve hot. Enjoy your delicious and comforting curried sweetcorn soup with chicken! ",
        "rating3": 5,
        "quantity": 0
    },
    {
        "id": "3",
        "chef_name": "Chef Susanna Foo",
        "experience": "7",
        "recipes_numbers": "28",
        "likes": "4.5",
        "description": "Chef Susanna Foo is a Chinese chef known for her fusion of  Chinese cuisine. She has won numerous awards, including the James Beard Foundation Award for Best Chef in the Mid-Atlantic Region. Foo has also authored several cookbooks and opened multiple restaurants, including her eponymous restaurant in Philadelphia.",
        "chef_img": "https://i.pinimg.com/736x/d5/de/f0/d5def0834a229ce41158d79f62a3a107.jpg",
        "recipe_img1": "https://susannafoo.com/wp-content/uploads/2021/04/DSC08858-768x432.jpg",
        "recipe_name1": "Sautéed Shrimp with Mango and Asparagus",
        "recipe_ingredients1": [
            "1 pound large shrimp, peeled and deveined",
            "1 large ripe mango, peeled and diced",
            "1 bunch asparagus, trimmed and cut into 2-inch pieces",
            "3 cloves garlic, minced",
            "1 tablespoon fresh ginger, grated",
            "2 tablespoons olive oil",
            "Salt and black pepper to taste",
            "2 tablespoons chopped fresh cilantro"
        ],
        "recipe_cooking_method1": "Heat the olive oil in a large skillet over medium-high heat. Add the minced garlic and grated ginger to the skillet. Stir and cook for 1-2 minutes until fragrant. Add the asparagus to the skillet and sauté for 3-4 minutes until it is crisp-tender. Add the shrimp to the skillet and sauté for 2-3 minutes until they turn pink and are cooked through. Add the diced mango to the skillet and stir gently to combine with the shrimp and asparagus. Cook for 1-2 minutes until the mango is heated through. Season the dish with salt and black pepper to taste. Sprinkle the chopped cilantro over the dish and serve immediately. Enjoy your delicious and colorful sautéed shrimp with mango and asparagus! ",
        "rating1": 5,
        "recipe_img2": "https://susannafoo.com/wp-content/uploads/2021/04/DSC08875-768x432.jpg",
        "recipe_name2": "Sweet Potato Souffle",
        "recipe_ingredients2": [
            "4 cups mashed sweet potatoes",
            "1/2 cup butter, melted",
            "1/2 cup milk",
            "1/2 cup sugar",
            "3 eggs, separated",
            "1 teaspoon vanilla extract",
            "1/2 teaspoon ground cinnamon",
            "1/4 teaspoon ground nutmeg",
            "1/4 teaspoon salt"
        ],
        "recipe_cooking_method2": "Preheat the oven to 350°F (175°C). In a large mixing bowl, combine the mashed sweet potatoes, melted butter, milk, sugar, egg yolks, vanilla extract, ground cinnamon, ground nutmeg, and salt. Mix well. In a separate mixing bowl, beat the egg whites until stiff peaks form. Fold the beaten egg whites into the sweet potato mixture gently, being careful not to overmix. Transfer the sweet potato mixture to a greased 9x13-inch baking dish. In a small mixing bowl, combine the brown sugar, all-purpose flour, melted butter, and chopped pecans. Mix well. Sprinkle the brown sugar mixture over the top of the sweet potato mixture in the baking dish. Bake the sweet potato souffle for 45-50 minutes until it is golden brown and set in the center. Allow the sweet potato souffle to cool for a few minutes before serving. Enjoy your delicious and sweet sweet potato souffle! ",
        "rating2": 4,
        "recipe_img3": "https://susannafoo.com/wp-content/uploads/2021/01/image-4-768x427.png",
        "recipe_name3": "Classic Hot and Sour Soup",
        "recipe_ingredients3": [
            "4 cups chicken or vegetable broth",
            "1/2 cup bamboo shoots, sliced",
            "1/2 cup mushrooms, sliced",
            "1/4 cup rice vinegar",
            "1/4 cup soy sauce",
            "1 tablespoon chili paste",
            "1 teaspoon sesame oil",
            "1 teaspoon ground white pepper",
            "1/4 teaspoon salt",
            "1/4 cup cornstarch",
            "1/4 cup water",
            "2 eggs, beaten",
            "1/2 cup firm tofu, cubed",
            "2 green onions, sliced",
            "Fresh cilantro, chopped (optional)"
        ],
        "recipe_cooking_method3": "In a large pot, bring the chicken or vegetable broth to a boil. Add the bamboo shoots and mushrooms to the pot and cook for 5-7 minutes until they are tender.Stir in the rice vinegar, soy sauce, chili paste, sesame oil, ground white pepper, and salt. Mix well. In a small bowl, whisk together the cornstarch and water until smooth. Slowly pour the cornstarch mixture into the pot, stirring constantly, until the soup thickens. Add the beaten eggs to the pot and stir gently until they form egg ribbons. Add the cubed tofu to the pot and stir gently. Ladle the hot and sour soup into bowls and garnish with sliced green onions and chopped cilantro, if desired. Enjoy your delicious and spicy hot and sour soup! ",
        "rating3": 3,
        "quantity": 0
    },
    {
        "id": "4",
        "chef_name": "Jon Zhang",
        "experience": "4",
        "recipes_numbers": "13",
        "likes": "3.5",
        "description": "Master Chef and Mentor With the title of National Senior Chef and 30 years of experience in the culinary industry, Zhang is well versed with the essentials of regional Chinese cuisines, especially in Huaiyang and Chaozhou cuisines. The former top chef from several 5-star hotels in Shanghai, Zhang was the Gold Award Winner for Huaiyang cuisine at the second NTD’s International Chinese Culinary Competition, and has gained the highest rating in New York Times’ food column. Zhang has been a judge for the third, fourth and fifth NTD’s International Chinese Culinary Competition.",
        "chef_img": "https://img.theepochtimes.com/assets/uploads/2019/03/22/Epoch-Times-chef-jon-zhang1.jpg",
        "recipe_img1": "https://www.sidechef.com/recipe/9ab9c9e1-8a1d-4f9b-82ed-038e8fe5593c.jpeg?d=1408x1120",
        "recipe_name1": "Braised Pork Belly",
        "recipe_ingredients1": [
            "2 lbs. pork belly, cut into 2-inch pieces",
            "4 garlic cloves, crushed",
            "1 inch ginger, sliced",
            "2 cups water",
            "1 cup soy sauce",
            "1 cup rice wine",
            "1/2 cup brown sugar",
            "2 cinnamon sticks",
            "3 star anise",
            "3 dried red chilies",
            "2 green onions, sliced",
            "Salt and pepper to taste"
        ],
        "recipe_cooking_method1": "Heat a large pot over medium-high heat. Add the pork belly and sear for 2-3 minutes on each side until browned. Add the garlic and ginger, and sauté for 1-2 minutes until fragrant. Add the water, soy sauce, rice wine, brown sugar, cinnamon sticks, star anise, and dried chilies. Stir to combine. Bring the mixture to a boil, then reduce the heat to low and cover the pot. Let the pork belly simmer for 1-1.5 hours, or until the meat is tender and the sauce has thickened. Stir occasionally to prevent sticking. Once the pork is cooked, remove it from the pot and set it aside on a plate. Increase the heat to high and let the sauce reduce for 5-10 minutes until thick and glossy. Taste the sauce and adjust the seasoning with salt and pepper as needed. Serve the pork belly with the reduced sauce and sliced green onions on top. Enjoy your delicious Braised Pork Belly! ",
        "rating1": 5,
        "recipe_img2": "https://omnivorescookbook.com/wp-content/uploads/2019/08/1710_Beef-Chow-Fun_550.jpg",
        "recipe_name2": "Beef Chow Fun",
        "recipe_ingredients2": [
            "8 oz. dried wide rice noodles",
            "1/2 lb. flank steak, sliced thinly against the grain",
            "1/2 red onion, sliced thinly",
            "1 red bell pepper, sliced thinly",
            "2 garlic cloves, minced",
            "2 tablespoons soy sauce",
            "2 tablespoons oyster sauce",
            "2 tablespoons vegetable oil",
            "Salt and pepper to taste",
            "Scallions, sliced, for garnish"
        ],
        "recipe_cooking_method2": "Soak the rice noodles in warm water for 30 minutes to soften. Drain and set aside. In a small bowl, combine the soy sauce and oyster sauce. Set aside. Heat a wok or large skillet over high heat. Add 1 tablespoon of vegetable oil and swirl to coat. Add the sliced beef and stir-fry for 2-3 minutes until browned. Remove the beef from the wok and set aside on a plate. Add another tablespoon of vegetable oil to the wok. Add the garlic, red onion, and bell pepper, and stir-fry for 2-3 minutes until the vegetables are tender. Push the vegetables to one side of the wok. Add the drained rice noodles to the other side and stir-fry for 1-2 minutes until heated through. Add the soy sauce and oyster sauce mixture to the wok, and toss everything together until the noodles are evenly coated. Add the beef back to the wok and toss everything together until the beef is reheated. Season with salt and pepper to taste. Serve hot with sliced scallions on top. Enjoy your delicious Beef Chow Fun! ",
        "rating2": 3.5,
        "recipe_img3": "https://img.tastelife.tv/assets/uploads/2022/05/Shanghai_Sweet_and_Sour_Pork_Ribs_Chef_John_01088_10x7-684x480.jpg",
        "recipe_name3": "Shanghai Sweet and Sour",
        "recipe_ingredients3": [
            "For the Pork:",
            "1 lb. pork tenderloin, sliced into thin strips",
            "1/2 cup cornstarch",
            "1 egg, beaten",
            "1/2 teaspoon salt",
            "1/4 teaspoon pepper",
            "Vegetable oil for frying",
            "For the Sauce:",
            "1/4 cup ketchup",
            "2 tablespoons soy sauce",
            "2 tablespoons rice vinegar",
            "2 tablespoons brown sugar",
            "1 tablespoon cornstarch",
            "1/4 cup water",
            "1 garlic clove, minced",
            "1/2 onion, chopped",
            "1/2 green bell pepper, chopped",
            "1/2 red bell pepper, chopped",
            "Salt and pepper to taste"
        ],
        "recipe_cooking_method3": "In a bowl, mix together the cornstarch, salt, and pepper. Dip the pork strips into the beaten egg, then coat them in the cornstarch mixture. Heat the vegetable oil in a deep-fryer or large pot over high heat. Once the oil is hot, fry the pork strips in batches until they are golden brown and crispy. Drain on a paper towel-lined plate. In a separate bowl, whisk together the ketchup, soy sauce, rice vinegar, brown sugar, cornstarch, and water until well combined. Heat a wok or large skillet over medium-high heat. Add 1 tablespoon of vegetable oil and swirl to coat. Add the garlic, onion, and bell peppers to the wok, and stir-fry for 2-3 minutes until tender. Pour the sauce mixture into the wok, and bring to a boil. Cook for 1-2 minutes until the sauce has thickened. Add the fried pork strips to the wok and toss to coat in the sauce. Season with salt and pepper to taste. Serve hot with steamed rice. Enjoy your delicious Shanghai Sweet and Sour! ",
        "rating3": 4.5,
        "quantity": 0
    },
    {
        "id": "5",
        "chef_name": "Chef Chen Yichun",
        "experience": "5",
        "recipes_numbers": "9",
        "likes": "5",
        "description": "Chef Chen Yichun is a renowned chef from Chine, known for his expertise in the culinary arts. He is the owner and head chef of the acclaimed restaurant Le Palais, which has received three Michelin stars for its exceptional Chinese cuisine. Chef Chen is known for his innovative approach to traditional Chinese dishes, using only the finest and freshest ingredients to create unique and flavorful creations. He has received numerous awards and recognition for his contributions to the culinary industry and is highly regarded by his peers and customers alike.",
        "chef_img": "https://img.tastelife.tv/assets/uploads/2020/02/Chef_Chen_Yichun_thumbnail.jpg",
        "recipe_img1": "https://img.tastelife.tv/assets/uploads/2020/05/Spaghetti_Bolognese_Chef_Chen_01026_9.jpg",
        "recipe_name1": "Spaghetti With Minced Beef In Tomato Sauce",
        "recipe_ingredients1": [
            "8 oz. spaghetti",
            "1/2 lb. ground beef",
            "1/2 onion, chopped",
            "2 garlic cloves, minced",
            "1 can (14 oz.) diced tomatoes",
            "1 tablespoon tomato paste",
            "1 teaspoon dried oregano",
            "Salt and pepper to taste",
            "2 tablespoons olive oil",
            "Grated Parmesan cheese, for serving"
        ],
        "recipe_cooking_method1": "Cook the spaghetti according to package instructions until al dente. Drain and set aside. In a large skillet, heat the olive oil over medium-high heat. Add the ground beef and cook until browned, breaking it up into small pieces with a wooden spoon. Add the chopped onion and minced garlic to the skillet, and cook for another 2-3 minutes until the onion is translucent. Add the can of diced tomatoes, tomato paste, and dried oregano to the skillet, and stir to combine. Reduce the heat to medium-low and simmer the sauce for 10-15 minutes, stirring occasionally, until it has thickened slightly. Season with salt and pepper to taste. Add the cooked spaghetti to the skillet and toss everything together until the pasta is coated in the sauce. Serve hot, topped with grated Parmesan cheese. Enjoy your delicious Spaghetti with Minced Beef in Tomato Sauce! ",
        "rating1": 5,
        "recipe_img2": "https://drdavinahseats.com/wp-content/uploads/2020/05/surf-and-turf-sq-on-a-plate-v2.jpg",
        "recipe_name2": "Surf & Turf",
        "recipe_ingredients2": [
            "8 oz. sirloin steak",
            "6 oz. lobster tail",
            "Salt and pepper to taste",
            "2 tablespoons butter",
            "2 garlic cloves, minced",
            "1 tablespoon chopped parsley"
        ],
        "recipe_cooking_method2": "Preheat your grill or a grill pan over medium-high heat. Season the sirloin steak with salt and pepper on both sides. Brush the lobster tail with melted butter and season with salt and pepper. Grill the steak for 3-4 minutes per side, or until it reaches your desired level of doneness. Grill the lobster tail for 5-6 minutes, or until the meat is opaque and cooked through. While the steak and lobster are cooking, prepare the garlic butter sauce. Melt the butter in a small saucepan over low heat, then add the minced garlic and cook for 1-2 minutes until fragrant. Stir in the chopped parsley. Once the steak and lobster are done, remove them from the grill and let them rest for a few minutes. To serve, place the steak on a plate and top it with a pat of the garlic butter sauce. Place the lobster tail next to the steak and drizzle more garlic butter sauce over the lobster. Serve hot and enjoy your delicious surf and turf! Note: You can also cook the steak and lobster in a pan or in the oven if you don't have access to a grill. ",
        "rating2": 3,
        "recipe_img3": "https://thewoksoflife.com/wp-content/uploads/2019/06/mapo-tofu-10.jpg",
        "recipe_name3": "Soft Tofu",
        "recipe_ingredients3": [
            "1 block (14 oz.) of soft tofu, cut into small cubes",
            "1/2 lb. ground pork",
            "1 tablespoon vegetable oil",
            "2 garlic cloves, minced",
            "2 green onions, chopped (white and green parts separated)",
            "1 tablespoon fermented black beans, rinsed and mashed",
            "1 tablespoon chili bean paste (doubanjiang)",
            "1 teaspoon Sichuan peppercorn, toasted and ground",
            "1 cup chicken or vegetable broth",
            "1 teaspoon cornstarch, dissolved in 1 tablespoon of water",
            "Salt and pepper to taste",
            "Chopped cilantro for garnish"
        ],
        "recipe_cooking_method3": "Heat the vegetable oil in a wok or a large skillet over medium-high heat. Add the ground pork to the wok and cook until browned, breaking it up into small pieces with a wooden spoon. Add the minced garlic, white part of the green onions, mashed black beans, chili bean paste, and ground Sichuan peppercorn to the wok, and stir to combine. Pour the chicken or vegetable broth into the wok and bring it to a simmer. Add the cubed tofu to the wok, and gently stir everything together. Let the tofu simmer in the sauce for 5-7 minutes, until it is heated through and has absorbed some of the flavors from the sauce. Add the cornstarch slurry to the wok, and stir gently to thicken the sauce. Season with salt and pepper to taste. Serve hot, topped with the green part of the chopped green onions and chopped cilantro for garnish. Enjoy your delicious Mapo Tofu! ",
        "rating3": 4,
        "quantity": 0
    },
    {
        "id": "6",
        "chef_name": "Chef Chan Yan-tak",
        "experience": "30",
        "recipes_numbers": "11",
        "likes": "4",
        "description": "Chef Chan Yan-tak is a Michelin-starred chef known for his expertise in Cantonese cuisine. He is the executive chef of Lung King Heen, a restaurant located in the Four Seasons Hotel in Hong Kong that has been awarded three Michelin stars. Chef Chan has over 30 years of culinary experience, and has worked in some of the top Cantonese restaurants in Hong Kong and Macau. He is highly respected in the culinary world and has been recognized with numerous awards and accolades for his cooking.",
        "chef_img": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2008/12/04/chan-yan-tak460.jpg?width=465&quality=85&dpr=1&s=none",
        "recipe_img1": "https://www.kikkoman.com/homecook/search/recipe/img/00000474.jpg",
        "recipe_name1": "Simmered Chicken and Asparagu",
        "recipe_ingredients1": [
            "2 chicken breasts, boneless and skinless",
            "Salt and pepper to taste",
            "1 tablespoon olive oil",
            "1 tablespoon butter",
            "2 garlic cloves, minced",
            "1/2 cup chicken broth",
            "1/2 cup heavy cream",
            "1 bunch of asparagus, trimmed and cut into 1-inch pieces",
            "1/4 cup grated Parmesan cheese",
            "Chopped parsley for garnish"
        ],
        "recipe_cooking_method1": "Season the chicken breasts with salt and pepper. Heat the olive oil and butter in a large skillet over medium-high heat.  Add the chicken breasts to the skillet and cook for 5-7 minutes on each side, until golden brown and cooked through. Remove the chicken from the skillet and set it aside on a plate. Add the minced garlic to the skillet and sauté for 1-2 minutes, until fragrant. Pour the chicken broth and heavy cream into the skillet, and stir to combine. Add the asparagus to the skillet, and bring the mixture to a simmer. Return the chicken breasts to the skillet, and let everything simmer together for 5-7 minutes, until the asparagus is tender and the chicken is heated through. Sprinkle grated Parmesan cheese over the top of the chicken and asparagus. Garnish with chopped parsley and serve hot. Enjoy your delicious and healthy Simmered Chicken and Asparagus! ",
        "rating1": 3,
        "recipe_img2": "https://asiasociety.org/files/uploads/526images/170329_dimsum2.jpg",
        "recipe_name2": "Dim Sum",
        "recipe_ingredients2": [
            "1 package of Dim Sum wrappers (also known as dumpling or wonton wrappers)",
            "Ground pork",
            "Shrimp",
            "Vegetables",
            "Soy sauce",
            "Sesame oil",
            "Rice vinegar for dipping sauce"
        ],
        "recipe_cooking_method2": "Make your filling by mixing together your desired ingredients. You can use ground pork, shrimp, vegetables, or a combination of these ingredients. Place a tablespoon of filling in the center of a Dim Sum wrapper. Moisten the edges of the wrapper with a little bit of water. Fold the wrapper in half to enclose the filling, and crimp the edges to seal. Place the filled Dim Sum on a plate or in a steamer basket. Repeat with the remaining filling and wrappers. Bring a pot of water to a boil, and place a bamboo steamer on top. Arrange the Dim Sum in the steamer, making sure they are not touching each other. Cover the steamer with a lid and steam the Dim Sum for 8-10 minutes, until cooked through. Serve the Dim Sum hot, with soy sauce, sesame oil, and rice vinegar for dipping sauce, if desired. Enjoy your delicious homemade Dim Sum! ",
        "rating2": 4,
        "recipe_img3": "https://images.chinahighlights.com/allpicture/2019/11/62745d5a726045e4a99a3885_cut_750x400_39.webp",
        "recipe_name3": "Ma Po Tofu",
        "recipe_ingredients3": [
            "14 oz (400 g) soft tofu, cut into small cubes",
            "1/2 lb (225 g) ground pork",
            "2 tablespoons vegetable oil",
            "1 tablespoon Sichuan peppercorns",
            "2 tablespoons chili bean sauce (doubanjiang)",
            "2 tablespoons fermented black beans, rinsed and mashed",
            "2 tablespoons soy sauce",
            "1 tablespoon sugar",
            "1/2 cup (120 ml) chicken broth",
            "2 garlic cloves, minced",
            "1 tablespoon ginger, minced",
            "2 green onions, chopped",
            "1 tablespoon cornstarch",
            "2 tablespoons water",
            "Chopped cilantro for garnish"
        ],
        "recipe_cooking_method3": "Heat the vegetable oil in a wok or a large skillet over medium-high heat. Add the Sichuan peppercorns to the oil and stir-fry for 1-2 minutes, until fragrant. Add the ground pork to the wok and stir-fry for 5-7 minutes, until browned and cooked through. Add the minced garlic, ginger, and green onions to the wok, and stir-fry for 1-2 minutes, until fragrant.Add the chili bean sauce and mashed fermented black beans to the wok, and stir-fry for another minute. Add the chicken broth, soy sauce, and sugar to the wok, and stir to combine. Gently add the cubed tofu to the wok, and stir gently to coat it with the sauce. Let the tofu simmer in the sauce for 5-7 minutes, until it has absorbed the flavors and is heated through. In a small bowl, mix together the cornstarch and water to make a slurry. Pour the slurry into the wok and stir gently to thicken the sauce. Serve the Ma Po Tofu hot, garnished with chopped cilantro. Enjoy your spicy and delicious Ma Po Tofu! ",
        "rating3": 3,
        "quantity": 0
    }
]